903257958/stm32_oop_driver/stm32f103c8_drivers/stm32f103c8_uart/driver/drv_uart.c
static uart_priv_t *uart_priv_alloc(uart_periph_t uart_periph);
static void uart_priv_free(uart_priv_t *priv);

static void uart_vprintf_impl(uart_dev_t *dev, const char *format, va_list args);
static void uart_printf_impl(uart_dev_t *dev, const char *format, ...);
static int uart_send_data_impl(uart_dev_t *dev, uint8_t *data, uint32_t len);
static int uart_recv_str_impl(uart_dev_t *dev, char *str);
static int uart_recv_data_impl(uart_dev_t *dev, uint8_t **data, uint32_t *len);
static int uart_deinit_impl(uart_dev_t *dev);

static void uart_idle_irq_handler(uart_periph_t uart_periph);

/* 操作接口表 */
static const uart_ops_t uart_ops = { 
	.vprintf   = uart_vprintf_impl,
    .printf    = uart_printf_impl,
    .send_data = uart_send_data_impl,
    .recv_str  = uart_recv_str_impl,
    .recv_data = uart_recv_data_impl,
    .deinit    = uart_deinit_impl
};

/**
 * @brief   初始化串口设备驱动
 * @details 只能配置支持 DMA 的串口，配置为 DMA 接收
 * @param[out] dev uart_dev_t 结构体指针
 * @param[in]  cfg uart_cfg_t 结构体指针
 * @return	0 表示成功，其他值表示失败
 */											
int drv_uart_init(uart_dev_t *dev, const uart_cfg_t *cfg)
{
	if (!dev || !cfg)
        return -EINVAL;
	
	if (cfg->rx_buf_size < (cfg->rx_single_max + 1))
        return -ENOMEM;

	uart_priv_t *priv = uart_priv_alloc(cfg->uart_periph);
	if (!priv)
		return -ENOMEM;

	/* 初始化接收数据控制块 */
	priv->rx_cb.idx_in = &priv->rx_cb.idx_buf[0];
	priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];
	priv->rx_cb.idx_end = &priv->rx_cb.idx_buf[IDX_BUF_NUM - 1];
	priv->rx_cb.idx_in->start = cfg->rx_buf;
	priv->rx_cb.data_cnt = 0;

	priv->dev = dev;
	dev->priv = priv;
    dev->cfg  = *cfg;
	dev->ops  = &uart_ops;

	/* 初始化硬件 */
	uart_hw_init(cfg);

	return 0;
}

/**
 * @brief   根据索引从私有数据数组中分配一个空闲槽位
 * @param[in] uart_periph 串口外设
 * @return	成功返回槽位指针，失败返回 NULL
 */
static uart_priv_t *uart_priv_alloc(uart_periph_t uart_periph)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);
    if (!hw_info)
		return NULL;
    
    uint8_t idx = hw_info->idx;
    if (g_uart_priv[idx].in_use)
		return NULL;
    
    g_uart_priv[idx].in_use = true;
    return &g_uart_priv[idx];
}

/**
 * @brief   释放私有数据槽位
 * @param[in,out] priv 待释放的槽位 uart_priv_t 结构体指针
 */
static void uart_priv_free(uart_priv_t *priv)
{
	if (priv)
		priv->in_use = false;
}

/**
 * @brief   串口格式化输出（使用已存在的 va_list）
 * @param[in] dev    uart_dev_t 结构体指针
 * @param[in] format 格式化字符串
 * @param[in] args   已经初始化的 va_list
 */
static void uart_vprintf_impl(uart_dev_t *dev, const char *format, va_list args)
{
    if (!dev || !format)
        return;

    const uart_hw_info_t *hw_info = uart_get_hw_info(dev->cfg.uart_periph);

    uart_hw_printf(hw_info, dev->cfg.tx_buf,
                   dev->cfg.tx_buf_size, format, args);
}

/**
 * @brief   串口格式化输出字符串
 * @param[in] dev 	 uart_priv_t 结构体指针
 * @param[in] format 格式化字符串
 * @param[in] ... 	 可变参数列表
 */
static void uart_printf_impl(uart_dev_t *dev, const char *format, ...)
{
	if (!dev || !format)
        return;

    va_list args;
    va_start(args, format);
    uart_vprintf_impl(dev, format, args);
    va_end(args);
}

/**
 * @brief   串口发送原始二进制数据
 * @details 直接将用户提供的缓冲区写入 UART 硬件，适用于任意协议数据
 * @param[in] dev  uart_priv_t 结构体指针
 * @param[in] data 待发送数据起始地址
 * @param[in] len  数据长度（字节）
 * @return	0 表示成功，其他值表示失败
 */
static int uart_send_data_impl(uart_dev_t *dev, uint8_t *data, uint32_t len)
{
	if (!dev || !data || !len)
        return -EINVAL;

	const uart_hw_info_t *hw_info = uart_get_hw_info(dev->cfg.uart_periph);

	uart_hw_send(hw_info, data, len);
	return 0;
}

/**
 * @brief   串口接收字符串
 * @details 从环形缓冲区取出一段连续数据，将其复制到用户提供的 str 中，
 * 			并自动在末尾补 '\0'，适用于 AT 命令、文本协议等。
 * @param[in]  dev uart_priv_t 结构体指针
 * @param[out] str 接收缓冲区，需由调用方分配
 * @return	0 表示成功，其他值表示失败
 */
static int uart_recv_str_impl(uart_dev_t *dev, char *str)
{
	if (!dev || !str)
        return -EINVAL;

    uart_priv_t *priv = (uart_priv_t *)dev->priv;

	/* 无数据 */
    if (priv->rx_cb.idx_in == priv->rx_cb.idx_out)
        return -EAGAIN;

	char *start = (char *)priv->rx_cb.idx_out->start;
	uint32_t len = priv->rx_cb.idx_out->end - priv->rx_cb.idx_out->start + 1;

	if (len >= dev->cfg.rx_single_max)
		len = dev->cfg.rx_single_max - 1;

	memcpy(str, start, len);
	str[len] = '\0';

	/* 处理完当前数据段后，移动idx_out指针到下一个位置，准备处理下一段数据 */
	priv->rx_cb.idx_out++;
	if (priv->rx_cb.idx_out == priv->rx_cb.idx_end)
		priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];

	return 0;
}

/**
 * @brief   串口接收原始数据（零拷贝，不添加 '\0'）
 * @details 该函数不进行 memcpy，也不在数据后追加 '\0'，完全适用于二进制协议（如 Xmodem、IAP、文件传输）
 *          返回的 data 指针指向环形缓冲区的原始内存区域。
 * 			注意：该指针在下一次接收后内容可能被覆盖，调用方应当在使用前及时处理或复制。
 * @param[in]  dev  uart_priv_t 结构体指针
 * @param[out] data 输出参数，返回数据首地址（无需调用方分配缓冲区，只需传入指针的地址）
 * @param[out] len  输出参数，返回数据长度
 * @return	0 表示成功，其他值表示失败
 */
static int uart_recv_data_impl(uart_dev_t *dev, uint8_t **data, uint32_t *len)
{
	if (!dev || !data || !len)
        return -EINVAL;

    uart_priv_t *priv = (uart_priv_t *)dev->priv;

    /* 无数据 */
    if (priv->rx_cb.idx_in == priv->rx_cb.idx_out) {
        *data = NULL;
        *len = 0;
        return -EAGAIN;
    }

    /* 读取起始地址和长度 */
    uint8_t *start = priv->rx_cb.idx_out->start;
    uint32_t l = priv->rx_cb.idx_out->end - priv->rx_cb.idx_out->start + 1;

    *data = start;
    *len  = l;

    /* 移动 idx_out 到下一段 */
    priv->rx_cb.idx_out++;
    if (priv->rx_cb.idx_out == priv->rx_cb.idx_end)
        priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];

    return 0;
}

/**
 * @brief   去初始化串口
 * @param[in] dev uart_dev_t 结构体指针
 * @return	0 表示成功，其他值表示失败
 */	
static int uart_deinit_impl(uart_dev_t *dev)
{
	if (!dev)
		return -EINVAL;

	uart_priv_t *priv = (uart_priv_t *)dev->priv;
	uart_priv_free(priv);
	dev->priv = NULL;
	dev->ops = NULL;
	return 0;
}

/**
 * @brief   串口通用空闲中断函数，内部使用
 * @param[in] uart_periph 串口外设
 */	
static void uart_idle_irq_handler(uart_periph_t uart_periph)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);
    uart_priv_t *priv = &g_uart_priv[hw_info->idx];
	uart_dev_t *dev = priv->dev;
	uint16_t rx_single_max = dev->cfg.rx_single_max;

    if (uart_hw_get_it_idle_flag(hw_info)) {	// 检查空闲中断标志
		uart_hw_clear_it_flag(hw_info);			// 清除空闲中断标志

		/* 计算已接收数据量 */
		priv->rx_cb.data_cnt += (rx_single_max + 1) -
			uart_hw_dma_get_curr_data_counter(hw_info);

		/* 标记这一段数据的结尾 */
		priv->rx_cb.idx_in->end = &dev->cfg.rx_buf[priv->rx_cb.data_cnt - 1];

		/* 接收数据后in指针向后移动一位 */
		priv->rx_cb.idx_in++;
		if (priv->rx_cb.idx_in == priv->rx_cb.idx_end)
			priv->rx_cb.idx_in = &priv->rx_cb.idx_buf[0];

		/* 判断数据缓冲区剩余大小 */
		if (dev->cfg.rx_buf_size - priv->rx_cb.data_cnt >= rx_single_max) {
			/* 剩余大小足够再接收一次数据，标记下一段数据的start */
			priv->rx_cb.idx_in->start = &dev->cfg.rx_buf[priv->rx_cb.data_cnt];
		} else {
			/* 剩余大小不够再接收一次数据，回卷 */
			priv->rx_cb.idx_in->start = &dev->cfg.rx_buf[0];
			priv->rx_cb.data_cnt = 0;
		}

		/* 重新配置 DMA ，准备下一次接收 */
		uart_hw_dma_rx_reconfig(hw_info, priv->rx_cb.idx_in->start, rx_single_max + 1);
	}
}

/* 各串口中断服务函数 */
#if defined(USART0)
void USART0_IRQHandler(void) { uart_idle_irq_handler(USART0); }
#endif

#if defined(USART1)
void USART1_IRQHandler(void) { uart_idle_irq_handler(USART1); }
#endif

#if defined(USART2)
void USART2_IRQHandler(void) { uart_idle_irq_handler(USART2); }
#endif

#if defined(USART3)
void USART3_IRQHandler(void) { uart_idle_irq_handler(USART3); }
#endif

#if defined(UART4)
void UART4_IRQHandler(void)  { uart_idle_irq_handler(UART4);  }
#endif

#if defined(UART5)
void UART5_IRQHandler(void)  { uart_idle_irq_handler(UART5);  }
#endif

#if defined(USART6)
void USART6_IRQHandler(void) { uart_idle_irq_handler(USART6); }
#endif

/* ------------------------------- 核心驱动层结束 ------------------------------- */
